package com.javaex.practice;

public class Ex05 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		/*
		
		[Ex05.java]
		
		자바소스파일(~. java)을 작성할 때 틀린것을 찾아 수정해보세요.
		
		(1) 패키지명은 일반적으로 가독성을 위해 대문자, 소문자 섞어 사용한다.
		(2) 클래스명은 소문자로만 구성하여 작성한다.
		(3) 자바소스파일(~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용해야된다.
		(4) 실행문 뒤(문자의 끝)에는 반드시 ( : )콜론을 사용해야 한다.
		(5) 처음으로 실행되는 함수의 이름은 개발자가 임의로 작성해서 만든다.
		
		---------------------------------------------------------------------
		
		(1) 패키지명은 일반적으로 가독성을 위해 대문자, 소문자 섞어 사용한다.
		
		 -> 패키지명은 소문자로 사용한다.
		 
		(2) 클래스명은 소문자로만 구성하여 작성한다.
		
		 -> 클래스명은 첫글자를 대문자로 작성한다.
		 
		(3) 자바소스파일(~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용해야된다.
		
		 -> 자바소스파일(~.java)명과 클래스 이름은 대소문자까지 모두 동일한 단어를 사용해야된다.
		
		(4) 실행문 뒤(문자의 끝)에는 반드시 ( : )콜론을 사용해야 한다.
		
		 -> 실행문 뒤(문자의 끝)에는 ( : )콜론이 아닌 ( ; )세미콜론을 사용해야 한다.
		 
		(5) 처음으로 실행되는 함수의 이름은 개발자가 임의로 작성해서 만든다.
		
		 -> 처음으로 실행되는 함수는 public static vodi main(String[] args) 를 작성..?
		 -> 자바 인터프리터는 자바 프로그램의 시작지점으로 
		 -> main 함수를 찾아서 함수내의 명령을 순차적으로 진행한다.
		
		*/

	}

}
