package com.javaex.practice;

public class Ex06 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		
		/*
		
		[Ex06.java]
		
		아래의 설명중 틀린 것을 찾아서 수정해 보세요.
		
		(1) 변수한개에는 동시에 여러 개의 값을 담을 수 있다.
		(2) 변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
		(3) 변수는 초기값이 저장되지 않아도 읽을 수 있다.
		(4) 모든 자료형의 변수는 동일한 방식으로 저장된다.
		(5) double형은 float보다 큰 수를 담을 수 있다.
		(6) int, float, char, String은 모두 기본자료형에 속한다.
		(7) final로 선언된 변수는 수정이 가능하다.
		(8) long형은 항상 L을 붙여서 대입해야한다.
		(9) float형은 항상 F을 분여서 대입해야한다.
		
		--------------------------------------------------
		
		(1) 변수한개에는 동시에 여러개의 값을 담을 수 있다.
		
		 -> 변수한개에는 한개의 값을 담는다.
		 
		(2) 변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
		
		 -> 변수는 선언시에 사용한 타입의 값을 저장, 조회, 변경 할 수 있어야 한다.
		
		(3) 변수는 초기값이 저장되지 않아도 읽을 수 있다.
		
		 -> 변수는 초기의 값을 저장하고 사용해야 한다.
		 
		(4) 모든 자료형의 변수는 동일한 방식으로 저장된다.
		
		 -> 변수에 저장할 데이터로 기본자료형과 참조자료형으로 나뉜다.
		 
		(5) double형은 float보다 큰 수를 담을 수 있다.
		
		 -> double형은 8byte , float형은 4byte로 dobule형이 더 큰 수를 담을 수 있다.
		 
		(6) int, float, char, String은 모두 기본자료형에 속한다.
		
		 -> int, float, char는 기본자료형, String은 참조자료형에 속한다.
		 
		(7) final로 선언된 변수는 수정이 가능하다.
		
		 -> final로 선언된 변수는 수정이 불가능하다.
		 
		(8) long형은 항상 L을 붙여서 대입해야한다.
		
		 -> long형은 l을 붙여서 사용하지만 int의 범위내라면 붙이지 않아도 된다.
		 
		(9) float형은 항상 F을 붙여서 대입해야한다.
		
		 -> float형은 F을 붙여서 대입해야한다. 대소문자는 상관없다.( F / f )
		
		*/

	}

}
